-- Здесь собраны все константы, которые нужны для декодирования DEFLATE-блоков,
-- и заранее построенные фиксированные деревья в стандарте RFC 1951
module Codec.Deflate.GlobalTypes (lengthCodes, distCodes, fixedLitLenTree, fixedDistTree) 
    where

import Data.Huffman (buildTree, HuffmanTree)

-- Таблица длин сопоставлений
-- элементы - (базовая длина, кол-во доп. бит), индекс в списке = code[len] - 257
lengthCodes :: [(Int, Int)]
lengthCodes = [
    (3,0), (4,0), (5,0), (6,0), (7,0), (8,0), (9,0), (10,0),   -- 257..264
    (11,1), (13,1), (15,1), (17,1),                             -- 265..268
    (19,2), (23,2), (27,2), (31,2),                             -- 269..272
    (35,3), (43,3), (51,3), (59,3),                             -- 273..276
    (67,4), (83,4), (99,4), (115,4),                            -- 277..280
    (131,5), (163,5), (195,5), (227,5),                         -- 281..284
    (258,0)]                                                     -- 285


-- Таблица расстояний
-- элементы - пара (базовое расстояние, кол-во доп. бит), индекс в списке - код от 0 до 29
distCodes :: [(Int, Int)]
distCodes = [
    (1,0), (2,0), (3,0), (4,0),                                 -- 0..3
    (5,1), (7,1),                                               -- 4..5
    (9,2), (13,2),                                              -- 6..7
    (17,3), (25,3),                                             -- 8..9
    (33,4), (49,4),                                             -- 10..11
    (65,5), (97,5),                                             -- 12..13
    (129,6), (193,6),                                           -- 14..15
    (257,7), (385,7),                                           -- 16..17
    (513,8), (769,8),                                           -- 18..19
    (1025,9), (1537,9),                                         -- 20..21
    (2049,10), (3073,10),                                       -- 22..23
    (4097,11), (6145,11),                                       -- 24..25
    (8193,12), (12289,12),                                      -- 26..27
    (16385,13), (24577,13)                                      -- 28..29
    ]

-- Порядок обхода кодов
codesOrder :: [Int]
codesOrder = [16, 17, 18, 0, 8, 7, 9, 6, 10, 5, 11, 4, 12, 3, 13, 2, 14, 1, 15]

-- Фикс. длины кодов для литералов и длин (RFC 1951, 3.2.6):
fixedLitLenLengths :: [Int]
fixedLitLenLengths = concat [replicate 144 8, replicate 112 9, replicate 24 7, replicate 8 8]

Just fixedLitLenTree = buildTree fixedLitLenLengths
Just fixedDistTree = buildTree (replicate 32 5)
